Revit 2026 API

# TemporaryViewModesIsValidState Method

---

Tests whether the given state is valid for the associated view and the context the view is currently in.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidState(
	PreviewFamilyVisibilityMode state
)
```
```vb
Public Function IsValidState (
	state As PreviewFamilyVisibilityMode
) As Boolean
```
```cpp
public:
bool IsValidState(
	PreviewFamilyVisibilityMode state
)
```
```fsharp
member IsValidState :
        state : PreviewFamilyVisibilityMode -> bool
```

#### Parameters

state PreviewFamilyVisibilityMode
     A state of the PreviewFamilyVisibilityMode

#### Return Value

Boolean Returns True if the state is applicable for the view; False otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

As long as the PreviewFamilyVisibility mode is available and enabled in the associated view, the _Off_ and _On_ states are always valid. However, the _Uncut_ state is only valid in plan views and reflected ceilings.

#### Reference

TemporaryViewModes Class

Autodesk.Revit.DB Namespace